package com.example.data

import androidx.compose.material.icons.Icons
import androidx.compose.material.icons.rounded.MenuBook
import androidx.compose.material.icons.rounded.Mosque
import androidx.compose.material.icons.rounded.NightlightRound
import androidx.compose.material.icons.rounded.WbSunny
import androidx.compose.ui.graphics.Color
import androidx.compose.ui.graphics.vector.ImageVector

data class ZikrItem(
    val arabic: String,
    val telugu: String,
    val meaning: String,
    val benefit: String
)

data class ChapterModel(
    val id: String,
    val titleTelugu: String,
    val titleArabic: String,
    val icon: ImageVector,
    val color: Color,
    val azkarList: List<ZikrItem>
)

object AzkarData {
    val morningAzkar = listOf(
        ZikrItem(
            arabic = """أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ★
بَسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ
اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ
{سورة البقرة 255}""",
            telugu = """1 అఊజు బిల్లాహి మిన షైతాన్ నిర్రజీమ్             బిస్మిల్లాహ్ హిర్రహ్మాన్ నిర్రహీమ్.
అల్లాహు లాఇలాహ ఇల్లా హువల్ హయ్యుల్ ఖయ్యూం లాతఅ ఖుజుహూ సినతుఁ వలా నౌమ్, లహూ మా ఫిస్సమావాతి వమా ఫిల్ అర్జి మన్ జల్లజీ యష్ ఫఉ ఇందహూ ఇల్లా బిఇజ్నిహీ యఅలము మా బైన ఐదీహిమ్ వమా ఖల్ ఫహుం వలా యుహీతూన బిషైఇమ్ మిన్ ఇల్మిహీ ఇల్లా బిమా షాఅ వసిఅ కుర్సియ్యుహుస్సమావాతి వల్ అర్జ వలా యఊదుహూ హిఫ్జుహుమా వహువల్ అలీయ్యుల్ అజీం. [ఒకసారి పఠించండి]
(సూర బఖరలోని ఆయత్ 2 : 255).""",
            meaning = """■ భావం: అల్లాహ్! ఆయన తప్ప నిజఆరాధ్యుడు మరొకడు లేడు. ఆయన సజీవుడు, అన్నింటికీ మూలాధారం, ఆయనకు కునుకు గానీ మరియు నిదురగానీ రానేరాదు. భూమ్యాకాశాలలో ఉన్న సమస్తమూ ఆయన ఆధీనంలో ఉంది, ఆయన అనుమతి లేకుండా ఆయన సమక్షంలో సిఫారసు చేయగలవాడెవడు? వారి ముందున్నదీ మరియు వారి వెనుక ఉన్నదీ అన్నీ ఆయనకు బాగా తెలుసు, మరియు ఆయన కోరినది తప్ప ఆయనకున్న జ్ఞానంలోని ఏ విషయమూ వారి గ్రాహ్యపరిధిలోకి రాదు, ఆయన కుర్సీ వైశాల్యం భూమ్యాకాశాలను పరివేష్ఠించి ఉంది, వాటి సంరక్షణ ఆయనకు ఏ మాత్రం అలసట కలిగించదు. మరియు ఆయన సర్వోన్నతుడు మరియు ఎంతో గొప్పవాడు.""",
            benefit = """■ ప్రయోజనం: దీనిని ఆయతుల్ కుర్సీ అంటారు , ఉదయాన దీన్ని పఠించినవారు సాయంత్రం వరకూ షైతాన్ బారి నుండి సురక్షితంగా ఉంటారు , అలాగే సాయంత్రం దీన్ని పఠించిన వారు ఉదయం వరకూ షైతాన్ బారినుండి సురక్షితంగా ఉంటారు. (హాకిం 1/562. హదీసు నంబర్. 2064. షేఖ్ అల్బానీ సహీహా 3162లో ప్రస్తావించారు)."""
        ),
        ZikrItem(
            arabic = """بسم الله الرحمن الرحيم★
قُلْ هُوَ اللَّهُ أَحَدٌ (1) اللَّهُ الصَّمَدُ (2) لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ (4)
بسم الله الرحمن الرحيم.
قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ (1) مِنْ شَرِّ مَا خَلَقَ (2) وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ (4) وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)
بسم الله الرحمن الرحيم.
قُلْ أَعُوذُ بِرَبِّ النَّاسِ (1) مَلِكِ النَّاسِ (2) إِلَهِ النَّاسِ (3) مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ (4) الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ (5) مِنَ الْجِنَّةِ وَالنَّاسِ(6)""",
            telugu = """2 బిస్మిల్లా హిర్రహ్మా నిర్రहీం.
ఖుల్ హువల్లాహు అహద్(1) అల్లాహుస్సమద్(2) లమ్ యలిద్ వలమ్ యూలద్(3) వలమ్ యకుల్లహూ కుఫువన్ అహద్(4).
■బిస్మిల్లా హిర్రహ్మా నిర్రహీం.
ఖుల్ అఊజు బిరబ్బిల్ ఫలఖ్(1) మిన్ షర్రి మా ఖలఖ్(2) వమిన్ షర్రి గాసిఖిన్ ఇజా వఖబ్(3) వమిన్ షర్రిన్ నఫ్ఫాసాతి ఫิล ఉఖద్(4) వమిన్ షర్రి హాసిదిన్ ఇజా హసద్(5).
■బిస్మిల్లా హిర్రహ్మా నిర్రహీం.
ఖుల్ అఊజు బిరబ్బిన్నాస్(1) మలికిన్నాస్(2) ఇలాహిన్నాస్(3) మిన్ షర్రిల్ వస్వాసిల్ ఖన్నాస్(4) అల్లజీ యువస్విసు ఫీ సుదూరిన్నాస్(5) మినల్ జిన్నతి వన్నాస్(6).
(ఖుర్ఆనులోని 112,113,114 సూరాలు).""",
            meaning = """భావం: ఇలా చెప్పు ఆయనే అల్లాహ్, ఏకైకుడు(1) అల్లాహ్ ఎవరి అక్కరా లేనివాడు(2) ఆయనకు సంతానం లేదు మరియు ఆయన కూడా ఎవరి సంతానమూ కాడు(3) ఆయనకు సరిసమానుడు ఎవడూ లేడు(4). ఇలా చెప్పు నేను ఉదయకాలపు ప్రభువు శరణులోకి వస్తున్నాను(1) ఆయన సృష్టించిన ప్రతిదాని కీడు నుండి(2) చిమ్మచీకటి కీడు నుండి ఎప్పుడైతే అది క్రమ్ముకుంటుందో(3) ముడుల మీద మంత్రించి ఊదే వారి కీడు నుండి(4) మరియు అసూయపరుడి కీడు నుండి ఎప్పుడైతే అతడు అసూయపడతాడో(5). ఇలా చెప్పు నేను శరణులోకి వస్తున్నాను మానవుల ప్రభువు(1) మానవుల సార్వభౌముడు(2) మానవుల నిజఆరాధ్యుని (యొక్క శరణులోకి వస్తున్నాను)(3) కలతలు రేకెత్తించి తొలగిపోయేవాని కీడు నుండి(4) ఎవడైతే మానవుల హృదయాలలో కలతలు రేకెత్తిస్తాడో(5) వాడు జిన్నాతులలోని వాడూ కావచ్చు లేదా మానవులలోని వాడూ కావచ్చు(6).""",
            benefit = """ప్రయోజనం: ఈ 3 సూరాలు ఉదయం, సాయంత్రం మూడేసి సార్లు చదువుతూ ఉండు, ఇది నిన్ను ప్రతి కీడు నుండి రక్షింప బడుటకు సరిపోతుందని ప్రవక్త ﷺ తెలిపారు. (అబూ దావూద్ 5082, హసన్)."""
        ),
        ZikrItem(
            arabic = """أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لله وَالْحَمْدُ لله لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الـْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذا اليَوْمِ وَخَيْرَ مَا بَعْدَهُ وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا اليَوْمِ وَشَرِّ مَا بَعْدَهُ رَبِّ أَعُوذُ بِكَ مِنْ الْكَسَلِ وَسُوءِ الْكِبَرِ رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ.""",
            telugu = """3 అస్ బహ్ నా వ అస్ బహల్ ముల్కు లిల్లాహ్, వల్ హందులిల్లాహ్. లాఇలాహ ఇల్లల్లాహు వహ్ దహూ లాషరీక లహూ లహుల్ ముల్కు వలహుల్ హందు వహువ అలా కుల్లి షైఇన్ కదీర్, రబ్బి అస్అలుక ఖైర మా ఫీ హాజల్ యౌమి వ ఖైర మా బఅదహూ వ అఊజు బిక మిన్ షర్రి మా ఫీ హాజల్ యౌమి వ షర్రి మా బఅదహూ, రబ్బి అఊజు బిక మినల్ కసలి వ సూఇల్ కిబరి వ అఊజు బిక మిన్ అజాబిన్ ఫిన్నారి వ అజాబిన్ ఫిల్ ఖబ్ర్. (ముస్లిం 2723).""",
            meaning = """భావం: మేము ఉదయాన్ని పొందాము , అల్లాహ్ సామ్రాజ్యమంతా తెల్లవారింది ఆయన కొరకే. సర్వస్తోత్రములు అల్లాహ్ కొరకే, అల్లాహ్ తప్ప నిజ ఆరాధ్యుడు ఎవ్వడూ లేడు, ఆయన ఏకైకుడు, ఆయనకు భాగస్వామి ఎవడూ లేడు, రాజ్యమంతా అయనదే, స్తోత్రములన్నియూ అయనకే, ఆయన సర్వముపై అధికారంగలవాడు. ప్రభువా! ఈ పగలులోని మేలును దీని తర్వాత వచ్చే మేలును నీతో కోరుతున్నాను. ఈ పగలులోని కీడు మరియు దీని తర్వాత వచ్చే కీడు నుండి నీ శరణు కోరుతున్నాను. ప్రభువా! బద్ధకం మరియు చెడు వృద్ధాప్యం నుండి నీ శరణు కోరుతున్నాను. ప్రభువా! నరక శిక్ష మరియు సమాధి శిక్ష నుండి నీ శరణు కోరుతున్నాము.""",
            benefit = ""
        ),
        ZikrItem(
            arabic = """اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ""",
            telugu = """4 అల్లాహుమ్మ బిక అస్'బహ్'నా, వ బిక అమ్ సైనా, వబిక నహ్'యా వబిక నమూతు వ ఇలైక'న్నుషూర్ (అబూ దావూద్ 5068).""",
            meaning = """భావం: ఓ అల్లాహ్, నీ పేరున మేము క్రొత్త ఉదయంలో చేరాము మరియు నీ పేరునే మేము క్రొత్త సాయంత్రంలో చేరాము. ఇంకా నీ పేరు మీదనే మేము జీవించి ఉన్నాము మరియు నీ పేరు మీదనే మేము మరణిస్తాము మరియు నీ వైపునకే మేము లేచి (తిరిగి) రావాల్సిఉంది""",
            benefit = ""
        ),
        ZikrItem(
            arabic = """للَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ أَنَّكَ أَنْتَ اللهُ لَا إِلَهَ إِلَّا أَنْتَ وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ""",
            telugu = """5 అల్లాహుమ్మ ఇన్నీ అస్ బహ్ తు ఉష్ హిదుక వ ఉష్ హిదు హమలత అర్షిక వ మలాఇకతక వ జమీఅ ఖల్ ఖిక అన్నక అంతల్లాహు లా ఇలాహ ఇల్లా అంత వ అన్న ముహమ్మదన్ అబ్దుక వ రసూలుక.""",
            meaning = """భావం: ఓ అల్లాహ్! నిశ్చయంగా నేను ఉదయానికి చేరాను. నిన్ను సాక్షిగా పెడుతున్నాను మరియు నీ సింహాసన పీఠాన్ని ఎత్తి ఉన్నవారిని,మరియు నీ దూతలందరిని ఇంకా సర్వసృష్టిని సాక్షిగా పెడుతున్నాను; నీవు మాత్రమే అల్లాహ్ అని, నీవు తప్ప నిజ ఆరాధ్యుడు ఎవ్వడూ లేడని, మరియు ముహమ్మద్ సల్లల్లాహు అలైహి వసల్లం నీ దాసుడు మరియు నీ ప్రవక్త అని సాక్షమిస్తున్నాను.""",
            benefit = """ప్రయోజనం: ఈ దుఆ ఉదయం చదివినట్లయితే వారి యొక్క పగలంతా జరిగిన పాపాలు మన్నించబడతాయి. సాయంకాలం చదివినవారి రాత్రంతా జరిగిన పాపాలు మన్నించబడతాయి. (అబూదావూద్ 5069, తిర్మిజి 3501). ◆ఈ దుఆ ఉదయం నాలుగు సార్లు చదివిన వారిని అల్లాహ్ ఆ రోజు నరకాగ్ని నుండి విముక్తి కలిగిస్తాడు. (అదబుల్ ముఫ్రద్ 1201). [షేఖ్ అల్బానీ ఈ హదీసు జఈఫ్ అన్నారు. కాని షేఖ్ బిన్ బాజ్ హసన్ అన్నారు]."""
        ),
        ZikrItem(
            arabic = """أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ وَعَلَى كَلِمَةِ الْإِخْلَاصِ وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ ﷺ وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنْ الْمُشْرِكِينَ""",
            telugu = """6 అస్ బహ్ నా అలా ఫిత్రతిల్ ఇస్లామి వ అలా కలిమతిల్ ఇఖ్లాసి వఅలా దీని నబియ్యినా ముహమ్మdiన్ సల్లల్లాహు అలైహి వసల్లమ వ అలా మిల్లతి అబీనా ఇబ్రాహీమ హనీఫమ్ ముస్లిమవ్ వమాకాన మినల్ ముష్రికీన్. (ముస్నద్ అహ్మద్ 3/406, సహీహుల్ జామి ).""",
            meaning = """భావం : మేము ఉదయానికి చేరాము ప్రకృతి స్వభావ ధర్మం అయిన ఇస్లాంపై, చిత్తశుద్ధితో కూడి ఉన్న వచనంపై, మా ప్రవక్త అయిన ముహమ్మద్ సల్లల్లాహు అలైహి వసల్లం యొక్క ధర్మంపై, మా పితామహుడు అయిన ఇబ్రాహీం అలైహిస్సలాం యొక్క మతముపై, ఆయన ఏకాగ్రులు, విశ్వాసులు, ముష్రికులలోని వారు కారు.""",
            benefit = ""
        ),
        ZikrItem(
            arabic = """لاَ إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ""",
            telugu = """7 లాఇలాహ ఇల్లల్లాహు వహ్'దహూ లాషరీకలహు లహుల్ ముల్కు వలహుల్ హందు వహువ అలా కుల్లి షైఇన్ ఖదీర్. ★(100 సార్లు పఠించండి) [బుఖారీ 6403, ముస్లిం 2691].""",
            meaning = """భావం : అల్లాహ్ తప్ప నిజ ఆరాధ్యుడు మరెవ్వడూ లేడు ,ఆయన ఏకైకుడు , ఆయనకు భాగస్వాములెవ్వరూ లేరు, ఆయనదే సామ్రాజ్యం, మరియు ఆయనకే సకల స్తోత్రములు, మరియు ఆయన ప్రతీ దానిపై సంపూర్ణ అధికారం కలిగి ఉన్నాడు .""",
            benefit = """ప్రయోజనం: దీనిని 100 సార్లు చదివితే (ఇస్మాఈల్ అలైహిస్సలం గారి వంశానికి చెందిన) ●పది మంది బానిసలను విడుదల చేసినంత పుణ్యం లభిస్తుంది, ●100పుణ్యాలు వ్రాయబడతాయి, ●100 పాపాలు తొలగించబడతాయి, ●కంప్యూటర్/ఫోన్ లో సాయంకాలం వరకు షైతాన్ నుండి రక్షింపబడతాడు, ●అతనికంటే ఎక్కువ చదివినవాడు తప్ప మరెవ్వడూ అతనికంటే ఉత్తముడు కాడు. (బుఖారి 6403, ముస్లిం 2691). ★ పై జిక్ర్ ఉదయం పది సార్లు చదివినవారికి అల్లాహ్ పది పుణ్యాలు వ్రాస్తాడు, పది పాపాలు మన్నిస్తాడు, పది స్థానాలను పెంచుతాడు, నాలుగు బానిసలకు విముక్తి కలిగించినంత పుణ్యం లభిస్తుంది మరియు సాయంకాలం వరకు షైతాన్ నుండి కాపాడబడతాడు. సాయంకాలం పది సార్లు చదివితే ఇలాంటి ఘనతే ఉంది. (ఇబ్నుహిబ్బాン 2021, సహీహుత్ తర్గీబ్ 474). బద్ధకం ఉంటే కనీసం ఒకసారైనా చదవాలి. (అబూదావూద్ 5077)."""
        ),
        ZikrItem(
            arabic = """اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ""",
            telugu = """8 అల్లాహుమ్మ మా అస్బహ బీమిన్ నిఅమతిన్ ఫమిన్క వహ్ దక లా షరీక లక ఫలకల్ హందు వలకష్షుక్ర్. {1 సారి పఠించండి}""",
            meaning = """భావం : ఓ అల్లాహ్! ఉదయకాలమున నాకు లభించిన అనుగ్రహాలన్నియూ నీ తరఫునే, నీవు ఏకైకుడువి, నీకు ఏ భాగస్వామి లేడు, సర్వ స్తోత్రములు నీకే, సర్వ కృతజ్ఞతలు నీకే""",
            benefit = """ప్రయోజనం : పై దుఆ ఉదయం చదివిన వ్యక్తి పగటి యొక్క కృతజ్ఞత చెల్లించినవాడవుతాడు, సాయంకాలం చదివిన వ్యక్తి రాత్రి కృతజ్ఞత చెల్లించినవాడవుతాడు. (అబూదావూద్ 5073. ). [షేఖ్ అల్బానీ ఈ హదీసు జఈఫ్ అన్నారు. కాని షేఖ్ బిన్ బాజ్ హసన్ అన్నారు]."""
        ),
        ZikrItem(
            arabic = """بِسْمِ اللهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلاَ فِي السَّمَاءِ وَهُوَ السَّمِيعُ العَلِيم""",
            telugu = """9 బిస్మిల్లాహిల్లజి లా యజుర్రు మఅస్మిహీ షైఉన్ ఫిల్ అర్జి వలా ఫిస్సమాఇ వహువస్సమీఉల్ అలీం. {3 సారి పఠించండి}""",
            meaning = """భావం : అల్లాహ్ పేరుతో, ఆయన పేరుతో ఏ వస్తువు నష్టపరచదు, ఆకాశంలోగాని, భూమిలోగాని, ఆయన వినువాడు, సర్వజ్ఞాని""",
            benefit = """ప్రయోజనం : పై దుఆ ఉదయం 3 సార్లు, సాయంకాలం 3 సార్లు చదివినవారికి ఏదీ నష్టపరచదు. (అబూదావూద్ 5088)."""
        ),
        ZikrItem(
            arabic = """رَضِيتُ بِاللهِ رَبًّا وَ بِالإِسْلامِ دِ ينًا وَبِمُحَمَّدٍ ﷺ نَبِيًّا""",
            telugu = """10 రజీతు బిల్లాహి రబ్బౌఁ వబిల్ ఇస్లామి దీనౌఁ వ బిముహమ్మదిన్ సల్లల్లాహు అలైహి వసల్లమ నబియ్య. {3 సారి పఠించండి}""",
            meaning = """భావం : అల్లాహ్ ను ప్రభువుగా, ఇస్లాంను ధర్మంగా, ముహమ్మద్ సల్లల్లాహు అలైహి వసల్లంను ప్రవక్తగా నమ్మి సంతోషపడ్డాను .""",
            benefit = """ప్రయోజనం : ఈ దుఆ ఉదయం 3 సార్లు, సాయంకాలం 3 సార్లు చదివినవారితో అల్లాహ్ ప్రళయదినాన తప్పక సంతో- షంగా ఉంటాడు. (తిర్మిజి 3870). ◆ఈ దుఆ ఉదయం చదివినవారి చేయి పట్టుకొని స్వర్గంలో తీసుకెళ్తాను అని ప్రవక్త సల్లల్లాహు అలైహి వస్లలం చెప్పారు. (సహీహుత్ తర్గీబ్ 657)."""
        ),
        ZikrItem(
            arabic = """حَسْبِيَ الله لاَ إِلهَ إلاَّ هُوَ عَلَيهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيم""",
            telugu = """11 హస్బియల్లాహు లాఇలాహ ఇల్లాహువ అలైహి తవక్కల్తు వహువ రబ్బుల్ అర్షిల్ అజీం. {7 సారి పఠించండి} (అబూదావూద్ 5081).""",
            meaning = """భావం : నాకు అల్లాహ్ యే చాలు, ఆయన తప్ప నిజఆరాధ్యుడు ఎవ్వడూ లేడు, ఆయనపైనే నేను నమ్మకం ఉంచాను, ఆయన గొప్ప సింహాసనం యొక్క ప్రభువు""",
            benefit = ""
        ),
        ZikrItem(
            arabic = """اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلهَ إلاَّ أنتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَااسْتَطَعْتُ أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِيْ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ""",
            telugu = """12 అల్లాహుమ్మ అంత రబ్బి లా ఇలాహ ఇల్లా అంత ఖలక్ తనీ వ అనా అబ్దుక వఅన అలా అహ్దిక వ వఅదిక మస్తతఅతు అఊజు బిక మిన్ షర్రి మా సనఅతు అబూఉ లక బినిఅమతిక అలయ్య వఅబూఉ లక బిజంబీ ఫగ్ఫిర్లీ ఫఇన్నహూ లా యగ్ఫిరుజ్జునూబ ఇల్లా అంత. {1 సారి పఠించండి}""",
            meaning = """భావం : ఓ అల్లాహ్! నీవే నా ప్రభువు, నీవు తప్ప నిజఆరాధ్యుడు ఎవ్వడూ లేడు, నీవే నన్ను సృష్టించావు, నేను నీ దాసుడ్ని, నేను నీతో చేసిన ఒడంబడిక, వాగ్దానంపై స్థిరంగా ఉన్నాను, నేను పాల్పడిన పాపాల కీడు నుండి నీ శరణులోకి వచ్చుచున్నాను, నాపై ఉన్న నీ అనుగ్రహాలను నేను అంగీకరిస్తున్నాను, నా పాపాలను కూడా ఒప్పుకుంటున్నాను, నీవు నన్ను క్షమించు, పాపాలను క్షమించేవాడు నీ తప్ప ఎవడూ లేడు.""",
            benefit = """ప్రయోజనం : పై దుఆ పూర్తి విశ్వాసంతో ఉదయం చదివిన వ్యక్తి సాయంకాలముకు ముందే అతను మరణిస్తే స్వర్గంలో చేరుతాడు, ఒకవేళ సాయంకాలం పూర్తి నమ్మకంతో చదవి ఉదయించక ముందే మరణిస్తే స్వర్గంలో చేరుతాడు. (బుఖారి 6306)."""
        ),
        ZikrItem(
            arabic = """اللَّهُمَّ عَافِنِي فِي بَدَنِي اللَّهُمَّ عَافِنِي فِي سَمْعِي اللَّهُمَّ عَافِنِي فِي بَصَرِي لَا إِلَهَ إِلَّا أَنْتَ ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْكُفْرِ وَالْفَقْرِ وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ لَا إِلَهَ إِلَّا أَنْتَ""",
            telugu = """13 అల్లాహుమ్మ ఆఫినీ ఫీ బదనీ అల్లాహుమ్మ ఆఫినీ ఫీ సమ్ఈ అల్లాహుమ్మ ఆఫినీ ఫీ బసరీ లాఇలాహ ఇల్లా అంత, అల్లాహుమ్మ ఇన్నీ అఊజుబిక మినల్ కుఫ్రి వల్ ఫక్రి వ అఊజు బిక మిన్ అజాబిల్ కబ్రి లాఇలాహ ఇల్లా అంత. {1 సారి పఠించండి} (అబూ దావూద్ 5090).""",
            meaning = """భావం : ఓ అల్లాహ్! నా శరీరంలో స్వస్థత ప్రసాదించు, ఓ అల్లాహ్! నా చెవిలో స్వస్థత ప్రసాదించు, ఓ అల్లాహ్! నా దృష్టిలో స్వస్థత ప్రసాదించు, నీవు తప్ప నిజఆరాధ్యుడు ఎవ్వడూ లేడు. ఓ అల్లాహ్! సత్యతిరస్కారం మరియు బీదరికం నుండి నీ శరణు వేడుకుంటున్నాను , ఓ అల్లాహ్! సమాధి శిక్ష నుండి నీ శరణు వేడుకుంటున్నాను. నీవు తప్ప నిజఆరాధ్యుడు ఎవ్వడూ లేడు.""",
            benefit = ""
        ),
        ZikrItem(
            arabic = """اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ اَللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِيْنِي وَ دُنْيَايَ وَأَهْلِيْ وَمَالِيْ اللَّهُمَّ اسْتُرْ عَوْرَاتِيْ وَآمِنْ رَوْعَاتِي اللَّهُمَّ احْفَظْنِيْ مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِيْ وَعَنْ يَمِيْنِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي وَأَعُوذُ بِعَظْمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي""",
            telugu = """14 అల్లాహుమ్మ ఇన్నీ అస్అలుకల్ ఆఫియత ఫిద్దున్యా వల్ ఆఖిర, అల్లాహుమ్మ ఇన్నీ అస్అలుకల్ అఫ్వ వల్ ఆఫియత ఫీ దీనీ వ దున్యాయ వ అహ్లీ వ మాలీ, అల్లాహుమ్మస్ తుర్ ఔరాతీ వ ఆమిన్ రౌఆతీ అల్లాహుమ్మహ్ ఫజ్నీ మిన్ బైని యదయ్య వ మిన్ ఖల్ఫీ వ అన్ యమీనీ వ అన్ షిమాలీ వ మిన్ ఫౌకీ వ అఊజు బిఅజ్మతిక అన్ ఉగ్ తాల మిన్ తహ్ తీ. {1 సారి పఠించండి}""",
            meaning = """భావం : ఓ అల్లాహ్! నేను నీతో ఇహపరాల క్షేమాన్ని కోరుతున్నాను, ఓ అల్లాహ్! నేను నీతో నా ధార్మిక, ప్రాపంచిక ,ఇంటివారి, ఆస్తుల్లో మన్నింపు మరియు క్షేమాన్ని కోరుతున్నాను. ఓ అల్లాహ్! నా లోటుపోట్లను కప్పిఉంచు, నా భయాన్ని దూరం చేయి, ఓ అల్లాహ్! నన్ను నా ముందు నుండి, నా వెనక నుండి, నా కుడి, ఎడమ నుండి మరియు పై నుండి కాపాడు. నేను క్రింది నుండి కూడా ఏ కీడుకు గురి కాకుండా నీ ఔన్నత్యంతో నీ శరణులో వచ్చాను.""",
            benefit = ""
        ),
        ZikrItem(
            arabic = """اللَّهُمَّ فَاطِرَ السَّمَاوَاتِ وَالأرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ رَبَّ كُلِّ شَيْءٍ وَ مَلِيْكَهُ أَشْهَدُ أَن لاَّ إِلَهَ إِلاَّ أَنْتَ أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوْءً أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ""",
            telugu = """15 అల్లాహుమ్మ ఫాతిరస్సమావాతి వల్ అర్జి ఆలిమల్ గైబి వష్షహాదతి రబ్బ కుల్లి షైఇన్ వ మలీకహు అష్'హదు అల్లా ఇలాహ ఇల్లా అంత అఊజు బిక మిన్ షర్రి నఫ్సీ వ షర్రిష్ షైతాని వ షిర్కిహీ, వఅన్ అక్తరిఫ అలా నఫ్సీ సూఅన్ ఔ అజుర్రహూ ఇలా ముస్లిమ్. {1 సారి పఠించండి}""",
            meaning = """భావం : ఓ అల్లాహ్! భూమ్యాకాశాల సృష్టికర్తా! గోచర అగోచరాల జ్ఞానీ! ప్రతీ వస్తువు ప్రభువా! మరియు యజమానీ! నీ తప్ప నిజఆరాధ్యుడు ఎవడూ లేడని నేను సాక్ష్యమిస్తున్నాను, నేను నీ శరణులో వచ్చాను; నా ఆత్మ కీడు నుండి, షైతాన్ కీడు నుండి, అతని షిర్క్, ప్రేరేపణల నుండి, అలాగే నేను నా పట్ల- గాని లేదా ఎవరైనా ముస్లింను చెడుకు గురి చేయుట నుండి.""",
            benefit = ""
        ),
        ZikrItem(
            arabic = """يَا حَيُّ يَا قَيُّومُ بِكَ اَسْتَغِيثُ فَأَصْلِحْ لِيْ شَأْنِي وَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْن""",
            telugu = """16 యా హయ్యు యా ఖయ్యూమ్ బిక అస్తగీస్, ఫఅస్లిహ్ లీ షఅనీ వలా తкиల్నీ ఇలా నఫ్సీ తర్ఫత ఐన్. {1 సారి పఠించండి} (అబూ దావూద్ 5090).""",
            meaning = """భావం : ఓ సజీవుడా, విశ్వవ్యవస్థకు ఆధారభూతుడా! నీతోనే నేను మొరపెట్టుకుంటున్నాను. అందుకని నా ప్రతి కార్యాన్ని సజావుగా చేయు, కనురెప్పపాటు కూడా నన్ను నాకై అప్పగించకు .""",
            benefit = ""
        ),
        ZikrItem(
            arabic = """سُبْحَانَ الله وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ""",
            telugu = """17 సుబ్'హానల్లాహి వ బిహందిహీ అదద ఖల్కిహీ వ రిజా నఫ్సిహీ వ జినత అర్షిహీ వ మిదాద కలిమాతిహ్. {3సార్లు పఠించండి}""",
            meaning = """భావం : అల్లాహ్ స్తోత్రముతో పాటు ఆయన పవిత్రతను కొనియాడుతున్నాను, ఆయన సమస్తసృష్టి రాసుల పరిమాణంలో, ఆయన ఇష్టపడేటంతటి, మరియు ఆయన సింహాసన బరువుకు సమానంగా మరియు ఆయన స్తోత్రం తో కూడిన పవిత్ర వచనాలు వ్రాయబడే సిరా అంత పరిమాణంలో ఆయనను ప్రశంసిస్తున్నాను . ◆(ఈ ఆఖరి మాటలో ఉన్న సిరా పరిమాణం గూర్చి గ్రహించేందుకు గాను ఖుర్ఆన్ 31 : 27 _ 18 : 109 దర్శించండి )""",
            benefit = """ప్రయోజనం : ఈదుఆ ఫజ్ర్ తర్వాత 3 సార్లు చదివితే, ఫజ్ర్ నుండి చాష్త్ సమయం వరకు చేసే జిక్ర్ కు సమానమైన పుణ్యం లభిస్తుంది. (ముస్లిం 2726)."""
        ),
        ZikrItem(
            arabic = """سُبْحَانَ اللهِ وَ بِحَمْدِهِ (100 مرة)""",
            telugu = """18 సుబ్'హానల్లాహి వబిహందిహీ. (100 సార్లు )""",
            meaning = """భావం : అల్లాహ్ ప్రశంసతో పాటు ఆయన పవిత్రతను నేను కొనియాడు చున్నాను.""",
            benefit = """ప్రయోజనం : ఈ జిక్ర్ ఉదయం 100 సార్లు, సాయంకాలం 100 సార్లు చదివినవారికంటే ఉత్తములు ప్రళయదినాన మరెవరూ ఉండరు, కేవలం అతని పరిమాణంలో, లేదా అతని కంటే ఎక్కువ చదివిన వ్యక్తి తప్ప. (ముస్లిం 2692). మరియు ఈ జిక్ర్ ఉదయం, సాయంకాలం , వంద సార్లు చదివిన వారి పాపాలు సముద్రపు నురుగుకు సమానమైనప్పటికీ క్షమించబడతాయి. (సహీహుత్ తర్గీబ్ 653)."""
        ),
        ZikrItem(
            arabic = """أَعُوذُ بِكَلِمَاتِ الله التَّامَّاتِ مِن شَرِّ مَا خَلَق""",
            telugu = """19 أఊజు బికలిమాతిల్లాహిత్తామ్మాతి మిన్ షర్రి మా ఖలఖ్. {3 సార్లు పఠించండి}""",
            meaning = """భావం : అల్లాహ్ సంపూర్ణ వచనాలతో నేను శరణు కోరుతున్నాను, ఆయన సృష్టిలో ఉన్న సర్వ కీడుల నుండి. {3 సారి పఠించండి}""",
            benefit = """ప్రయోజనం : ఈ దుఆ సాయంకాలం 3 సార్లు చదివినవారికి ఆ రాత్రి ఏ విషపురుగు హాని కలిగించదు. (ముస్లిం 2709)."""
        ),
        ZikrItem(
            arabic = """أَسْتَغْفِرُ اللهَ وَأَتُوبُ إِلَيْهِ""",
            telugu = """20 అస్తగ్ ఫిరుల్లాహ వ అతూబు ఇలైహ్. { 100 సార్లు పఠించండి}""",
            meaning = """భావం : నేను అల్లాహ్ యొక్క మన్నింపు వేడుకుంటున్నాను, ఆయన సమక్షంలో తౌబా (ప్రత్యతాపము) చేస్తున్నాను .""",
            benefit = """ప్రయోజనం : ◆ఈ జిక్ర్ ప్రవక్త సల్లల్లాహు అలైహివ వసల్లం ప్రతి రోజు వందసార్లు చదివేవారు. (ముస్లిం 2702)."""
        ),
        ZikrItem(
            arabic = """اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ عَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ . اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَ عَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ""",
            telugu = """21 దరూద్ ◆ అల్లాహుమ్మ సల్లి అలా ముహమ్మదివ్ వ అలా ఆలి ముహమ్మద్ కమా సల్లయిత అలా ఇబ్రహీమ వ అలా ఆలి ఇబ్రహీమ ఇన్నక హమీదుంమ్మజీద్ . అల్లాహుమ్మ బారిక్ అలా ముహమ్మదివ్ వ అలా ఆలి ముహమ్మద్ కమా బారక్ త అలా ఇబ్రహీమ వ అలా ఆలి ఇబ్రహీమ ఇన్నక హమీదుంమ్మజీద్ .""",
            meaning = """భావం : ఓ.! అల్లాహ్ ముహమ్మద్(సల్లల్లాహు అలైహి వ సల్లం) వారినీ మరియు ఆయన కుటుంబం వారినీ కరుణించు .ఏ విధంగానైతే ఇబ్రహీం(అలైహిసలాం) వారినీ మరియు ఆయన కుటుంబాన్ని నీవు కరుణించావో..నీవే స్తోత్రానికి అర్హుడవు, ఘనత గలవాడవు. ఓ ! అల్లాహ్ ముహమ్మద్ (సల్లల్లాహు అలైహి వ సల్లం ) వారిపై ఆయన కుటుంబం వారిపై శుభాలు కురిపించు , ఏ విధంగానైతే ఇబ్రహీం (అలైహిసలాం) వారిపై మరియు ఆయన కుటుంబం వారిపై నీవు శుభాలు కురిపించావో నిస్సందేహంగా నీవే స్తుతింపదగినవాడవు , ఘనత గల వాడవు .""",
            benefit = """ప్రయోజనం : అల్లాహుమ్మ సల్లి వసల్లిమ్ వబاريక్ అలా నబియ్యినా ముహమ్మద్. భావం: ఓ అల్లాహ్ ప్రవక్త ముహమ్మద్ పై కరుణ, శాంతులు, శుభాలు కురిపించు. ప్రయోజనం: ఉదయం 10 సార్లు, సాయంకాలం 10 సార్లు దరూద్ చదివినవారి పట్ల ప్రవక్త సల్లల్లాహు అలైహి వసల్లం ప్రళయం నాడు సిఫారసు చేస్తారు. (సహీహుల్ జామి 6357)."""
        ),
        ZikrItem(
            arabic = """سُبْحَانَ اللهِ، والْحَمْدُ للهِ، وَلا إلَهَ إلاَّ اللهُ، وَاللهُ أكْبَرُ""",
            telugu = """22 సుబ్'హానల్లాహ్, అల్ హందులిల్లాహ్, లాఇలాహ ఇల్లల్లాహ్, అల్లాహు అక్బర్.""",
            meaning = "",
            benefit = """ప్రయోజనం: సూర్యోదయానికి ముందు, సూర్యాస్తమయానికి ముందు 100 సార్లు ‘సుబ్ హానల్లాహ్’ పలుకుట అల్లాహ్ మార్గంలో వదిలిన 100 ఒంటెల కంటే ఉత్తమం, 100 సార్లు ‘అల్ హందులిల్లాహ్’ పలుకుట అల్లాహ్ మార్గంలో వదిలిన 100 గుర్రాల కంటే ఉత్తమం. 100 సార్లు ‘అల్లాహు అక్బర్’ పలుకుట 100 బానిసలను విముక్తి కలిగించుట కంటే ఉత్తమం, 100 సార్లు ‘లాఇలాహ ఇల్లల్లాహు వహ్ దహూ లా షరీక లహూ లహుల్ ముల్కు లహుల్ హందు వహువ అలా కుల్లి షైఇన్ ఖదీర్’ పలికే వ్యక్తి కంటే ఉత్తమ ఆచరణ ప్రళయదినాన మరెవరిదీ ఉండదు, కేవలం అదే సంఖ్యలో లేదా అంతకంటే ఎక్కువ సంఖ్యలో పలికిన వ్యక్తి ఆచరణ తప్ప . (సహీ తర్గీబ్ 658)."""
        ),
        ZikrItem(
            arabic = """اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَ عَمَلاً مُتَقَبَّلاً""",
            telugu = """23 అల్లాహుమ్మ ఇన్నీ అస్అలుక ఇల్మన్ నాఫిఆ, వ రిజ్ఖన్ తయ్యిబా, వ అమలమ్ ముతకబ్బలా. ◆(కేవలం ఫజ్ర్ నమాజు తర్వాత 1 సారి పఠించండి ). [ఇబ్ను మాజ 925]""",
            meaning = """భావం: ఓ అల్లాహ్! ప్రయోజనకరమైన విద్య, పవిత్రమైన ఆహారం మరియు అంగీకారయోగ్యం పొందే ఆచరణ భాగ్యం ప్రసాదించమని నిన్నే వేడుకుంటును.""",
            benefit = ""
        )
    )

    val eveningAzkar = listOf(
        ZikrItem(
            arabic = """أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ★
بَسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ
اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ
{سورة البقرة 255}""",
            telugu = """1 అఊజు బిల్లాహి మిన షైతాన్ నిర్రజీమ్             బిస్మిల్లాహ్ హిర్రహ్మాన్ నిర్రహీమ్.
అల్లాహు లాఇలాహ ఇల్లా హువల్ హయ్యుల్ ఖయ్యూం లాతఅ ఖుజుహూ సినతుఁ వలా నౌమ్, లహూ మా ఫిస్సమావాతి వమా ఫిల్ అర్జి మన్ జల్లజీ యష్ ఫఉ ఇんだహూ ఇల్లా బిఇజ్నిహీ యఅలము మా బైన ఐదీహిమ్ వమా ఖల్ ఫహుం వలా యుహీతూన బిషైఇమ్ మిన్ ఇల్మిహీ ఇల్లా బిమా షాఅ వసిఅ కుర్సియ్యుహుస్సమావాతి వల్ అర్జ వలా యఊదుహూ హిఫ్జుహుమా వహువల్ అలీయ్యుల్ అజీం. [ఒకసారి పఠించండి]
(సూర బఖరలోని ఆయత్ 2 : 255).""",
            meaning = """■ భావం: అల్లాహ్! ఆయన తప్ప నిజఆరాధ్యుడు మరొకడు లేడు. ఆయన సజీవుడు, అన్నింటికీ మూలాధారం, ఆయనకు కునుకు గానీ మరియు నిదురగానీ రానేరాదు. భూమ్యాకాశాలలో ఉన్న సమస్తమూ ఆయన ఆధీనంలో ఉంది, ఆయన అనుమతి లేకుండా ఆయన సమక్షంలో సిఫారసు చేయగలవాడెవడు? వారి ముందున్నదీ మరియు వారి వెనుక ఉన్నదీ అన్నీ ఆయనకు బాగా తెలుసు, మరియు ఆయన కోరినది తప్ప ఆయనకున్న జ్ఞానంలోని ఏ విషయమూ వారి గ్రాహ్యపరిధిలోకి రాదు, ఆయన కుర్సీ వైశాల్యం భూమ్యాకాశాలను పరివేష్ఠించి ఉంది, వాటి సంరక్షణ ఆయనకు ఏ మాత్రం అలసట కలిగించదు. మరియు ఆయన సర్వోన్నతుడు మరియు ఎంతో గొప్పవాడు.""",
            benefit = """■ ప్రయోజనం: దీనిని ఆయతుల్ కుర్సీ అంటారు , ఉదయాన దీన్ని పఠించినవారు సాయంత్రం వరకూ షైతాన్ బారి నుండి సురక్షితంగా ఉంటారు , అలాగే సాయంత్రం దీన్ని పఠించిన వారు ఉదయం వరకూ షైతాన్ బారినుండి సురక్షితంగా ఉంటారు. (హాకిం 1/562. హదీసు నంబర్. 2064. షేఖ్ అల్బానీ సహీహా 3162లో ప్రస్తావించారు)."""
        ),
        ZikrItem(
            arabic = """بسم الله الرحمن الرحيم★
قُلْ هُوَ اللَّهُ أَحَدٌ (1) اللَّهُ الصَّمَدُ (2) لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ (4)
بسم الله الرحمن الرحيم.
قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ (1) مِنْ شَرِّ مَا خَلَقَ (2) وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ (4) وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)
بسم الله الرحمن الرحيم.
قُلْ أَعُوذُ بِرَبِّ النَّاسِ (1) مَلِكِ النَّاسِ (2) إِلَهِ النَّاسِ (3) مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ (4) الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ (5) مِنَ الْجِنَّةِ وَالنَّاسِ(6)""",
            telugu = """2 బిస్మిల్లా హిర్రహ్మా నిర్రహీం.
ఖుల్ హువల్లాహు అహద్(1) అల్లాహుస్సమద్(2) లమ్ యలిద్ వలమ్ యూలద్(3) వలమ్ యకుల్లహూ కుఫువన్ అహద్(4).
■బిస్మిల్లా హిర్రహ్మా నిర్రహీం.
ఖుల్ అఊజు బిరబ్బిల్ ఫలఖ్(1) మిన్ షర్రి మా ఖలఖ్(2) వమిన్ షర్రి గాసిఖిన్ ఇజా వఖబ్(3) వమిన్ షర్రిన్ నఫ్ఫాసాతి ఫิล ఉఖద్(4) వమిన్ షర్రి హాసిదిన్ ఇజా హసద్(5).
■బిస్మిల్లా హిర్రహ్మా నిర్రహీం.
ఖుల్ అఊజు బిరబ్బిన్నాస్(1) మలికిన్నాస్(2) ఇలాహిన్నాస్(3) మిన్ షర్రిల్ వస్వాసిల్ ఖన్నాస్(4) అల్లజీ యువస్విసు ఫీ సుదూриన్నాస్(5) మినల్ జిన్నతి వన్నాస్(6).
(ఖుర్ఆనులోని 112,113,114 సూరాలు).""",
            meaning = """భావం: ఇలా చెప్పు ఆయనే అల్లాహ్, ఏకైకుడు(1) అల్లాహ్ ఎవరి అక్కరా లేనివాడు(2) ఆయనకు సంతానం లేదు మరియు ఆయన కూడా ఎవరి సంతానమూ కాడు(3) ఆయనకు సరిసమానుడు ఎవడూ లేడు(4). ఇలా చెప్పు నేను ఉదయకాలపు ప్రభువు శరణులోకి వస్తున్నాను(1) ఆయన సృష్టించిన ప్రతిదాని కీడు నుండి(2) చిమ్మచీకటి కీడు నుండి ఎప్పుడైతే అది క్రమ్ముకుంటుందో(3) ముడుల మీద మంత్రించి ఊదే వారి కీడు నుండి(4) మరియు అసూయపరుడి కీడు నుండి ఎప్పుడైతే అతడు అసూయపడతాడో(5). ఇలా చెప్పు నేను శరణులోకి వస్తున్నాను మానవుల ప్రభువు(1) మానవుల సార్వభౌముడు(2) మానవుల నిజఆరాధ్యని (యొక్క శరణులోకి వస్తున్నాను)(3) కలతలు రేకెత్తించి తొలగిపోయేవాని కీడు నుండి(4) ఎవడైతే మానవుల హృదయాలలో కలతలు రేకెత్తిస్తాడో(5) వాడు జిన్నాతులలోని వాడూ కావచ్చు లేదా మానవులలోని వాడూ కావచ్చు(6).""",
            benefit = """ప్రయోజనం: ఈ 3 సూరాలు ఉదయం, సాయంత్రం మూడేసి సార్లు చదువుతూ ఉండు, ఇది నిన్ను ప్రతి కీడు నుండి రక్షింప బడుటకు సరిపోతుందని ప్రవక్త ﷺ తెలిపారు. (అబూ దావూద్ 5082, హసన్)."""
        ),
        ZikrItem(
            arabic = """أَمْسَيْنَا وأمسى الْمُلْكُ لله وَالْحَمْدُ لله لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الـْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيلَةِ وَخَيْرَ مَا بَعْدَهَا وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيلَةِ وَشَرِّ مَا بَعْدَهَا رَبِّ أَعُوذُ بِكَ مِنْ الْكَسَلِ وَسُوءِ الْكِبَرِ رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ.""",
            telugu = """3 అమ్ సైనా వ అమ్ సల్ ముల్కు లిల్లాహ్, వల్ హందులిల్లాహ్. లాఇలాహ ఇల్లల్లాహు వహ్ దహూ లాషరీక లహూ లహుల్ ముల్కు వలహుల్ హందు వహువ అలా కుల్లి షైఇన్ ఖదీర్, రబ్బి అస్అలుక ఖైర మా ఫీ హాజిహిల్ లైలతి వ ఖైర మా బఅదహా వ అఊజు బిక మిన్ షర్రి మా ఫీ హాజిహిల్ లైలతి వ షర్రి మా బఅదహా, రబ్బి అఊజు బిక మినల్ కసలి వ సూఇల్ కిబరి రబ్బి అఊజు బిక మిన్ అజాబిన్ ఫిన్నారి వ అజాబిన్ ఫిల్ ఖబ్ర్. (ముస్లిం 2723). [1సారి చదవండి].""",
            meaning = """భావం: మేము సాయంకాలాన్ని పొందాము, అల్లాహ్ సామ్రాజ్యమంతా సాయంకాలానికి చేరింది ఆయన కొరకే. సర్వస్తోత్రములు అల్లాహ్ కొరకే, అల్లాహ్ తప్ప నిజ ఆరాధ్యుడు ఎవ్వడూ లేడు, ఆయన ఏకైకుడు, ఆయనకు భాగస్వామి ఎవడూ లేడు, రాజ్యమంతా అయనదే, స్తోత్రములన్నియూ అయనకే, ఆయన సర్వముపై అధికారంగలవాడు. ప్రభువా! ఈ రాత్రిలోని మేలును దీని తర్వాత వచ్చే మేలును నీతో కోరుతున్నాను. ఈ రాత్రిలోని కీడు మరియు దీని తర్వాత వచ్చే కీడు నుండి నీ శరణు కోరుతున్నాను. ప్రభువా! బద్ధకం మరియు చెడు వృద్ధాప్యం నుండి నీ శరణు కోరుతున్నాను. ప్రభువా! నరక శిక్ష మరియు సమాధి శిక్ష నుండి నీ శరణు కోరుతున్నాము.""",
            benefit = ""
        ),
        ZikrItem(
            arabic = """اللَّهُمَّ بِكَ أَصْبَحْنَا ، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ المَصِير""",
            telugu = """4 అల్లాహుమ్మ బిక అమ్ సైనా, వ బిక అస్'బహ్'నా, వబిక నహ్'యా వబిక నమూతు వ ఇలైకల్ మసీర్. [ఒకసారి]. (అబూ దావూద్ 5068).""",
            meaning = """భావం: ఓ అల్లాహ్, నీ పేరున మేము క్రొత్త సాయంత్రంలో చేరాము మరియు నీ పేరునే మేము క్రొత్త ఉదయంలో చేరాము. ఇంకా నీ పేరు మీదనే మేము జీవించి ఉన్నాము మరియు నీ పేరు మీదనే మేము మరణిస్తాము మరియు నీ వైపునకే మేము తిరిగి వెళ్ళవలసి ఉంది.""",
            benefit = ""
        ),
        ZikrItem(
            arabic = """اللَّهُمَّ إِنِّي أَمْسَيْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ أَنَّكَ أَنْتَ اللهُ لَا إِلَهَ إِلَّا أَنْتَ وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ""",
            telugu = """5 అల్లాహుమ్మ ఇన్నీ అమ్ సైతు ఉష్ హిదుక వ ఉష్ హిదు హమలత అర్షిక వ మలాఇకతక వ జమీఅ ఖల్ ఖిక అన్నక అంతల్లాహు లా ఇలాహ ఇల్లా అంత వ అన్న ముహమ్మదన్ అబ్దుక వ రసూలుక. [ఒకసారి లేదా నాలుగు సార్లు చదవండి].""",
            meaning = """భావం: ఓ అల్లాహ్! నిశ్చయంగా నేను సాయంకాలానికి చేరాను. నిన్ను సాక్షిగా పెడుతున్నాను మరియు నీ సింహాసన పీఠాన్ని ఎత్తి ఉన్నవారిని, దైవ దూతలందరిని ఇంకా సర్వసృష్టిని సాక్షిగా పెడుతున్నాను; నీవు మాత్రమే అల్లాహ్ అని, నీ తప్ప నిజ ఆరాధ్యుడు ఎవ్వడూ లేడని, మరియు ముహమ్మద్ సల్లల్లాహు అలైహి వసల్లం నీ దాసుడు మరియు నీ ప్రవక్త అని సాక్షమిస్తున్నాను.""",
            benefit = """ప్రయోజనం: ఈ దుఆ ఉదయం చదివినవారి పగలంతా జరిగిన పాపాలు మన్నించబడతాయి. సాయంకాలం చదివినవారి రాత్రంతా జరిగిన పాపాలు మన్నించబడతాయి. (అబూదావూద్ 5069, తిర్మిజి 3501). ఈ దుఆ ఉదయం నాలుగు సార్లు చదివిన వారిని అల్లాహ్ ఆ రోజు నరకాగ్ని నుండి విముక్తి కలిగిస్తాడు. (అదబుల్ ముఫ్రద్ 1201). [షేఖ్ అల్బానీ ‘ ఈ హదీసుని జఈఫ్ అన్నారు. కాని షేఖ్ బిన్ బాజ్ ‘ హసన్ అన్నారు]."""
        ),
        ZikrItem(
            arabic = """أَمْسَيْنَا عَلَى فِطْرَةِ الْإِسْلَامِ وَعَلَى كَلِمَةِ الْإِخْلَاصِ وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ ﷺ وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنْ الْمُشْرِكِينَ""",
            telugu = """6 అమ్ సైనా అలా ఫిత్రతిల్ ఇస్లామి వ అలా కలిమతిల్ ఇఖ్లాసి వఅలా దీని నబియ్యినా ముహమ్మదిన్ సల్లల్లాహు అలైహి వసల్లమ వ అలా మిల్లతి అబీనా ఇబ్రాహీమ హనీఫమ్ ముస్లిమవ్ వమాకాన మినల్ ముష్రికీన్. (ముస్నద్ అహ్మద్ 3/406, sahীహుల్ జామి ).""",
            meaning = """భావం : మేము సాయంకాలానికి చేరాము ప్రకృతిస్వభావిక ధర్మం అయిన ఇస్లాంపై, చిత్తశుద్ధితో కూడి ఉన్న వచనంపై, మా ప్రవక్త అయిన ముహమ్మద్ సల్లల్లాహు అలైహి వసల్లం యొక్క ధర్మంపై, మా పితామహుడు అయిన ఇబ్రాహీం అలైహిస్సలాం యొక్క మతముపై, ఆయన ఏకాగ్రులు, విశ్వాసులు, ముష్రికులలోని వారు కారు).""",
            benefit = ""
        ),
        ZikrItem(
            arabic = """اللَّهُمَّ مَا أَمْسى بِي مِنْ نِعْمَةٍ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ""",
            telugu = """7 అల్లాహుమ్మ మా అమ్ సాబీ మిన్ నిఅమతిన్ ఫమిన్క వహ్ దక లా షరీక లక ఫలకల్ హందు వలకష్షుక్ర్.""",
            meaning = """భావం : మేము సాయంకాలానికి చేరాము ప్రకృతిస్వభావిక ధర్మం అయిన ఇస్లాంపై, చిత్తశుద్ధితో కూడి ఉన్న వచనంపై, మా ప్రవక్త అయిన ముహమ్మద్ సల్లల్లాహు అలైహి వసల్లం యొక్క ధర్మంపై, మా పితామహుడు అయిన ఇబ్రాహీం అలైహిస్సలాం యొక్క మతముపై, ఆయన ఏకాగ్రులు, విశ్వాసులు, ముష్రికులలోని వారు కారు).""",
            benefit = """ప్రయోజనం: ఈ దుఆ ఉదయం చదివిన వ్యక్తి పగటి కృతజ్ఞత చెల్లించినవాడవుతాడు, సాయంకాలం చదివిన వ్యక్తి రాత్రి కృతజ్ఞత చెల్లించినవాడవుతాడు. (అబూదావూద్ 5073). [షేఖ్ అల్బానీ ‘ ఈ హదీసుని జఈఫ్ అన్నారు. కాని షేఖ్ బిన్ బాజ్ ‘ హసన్ అన్నారు]."""
        ),
        ZikrItem(
            arabic = """بِسْمِ اللهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلاَ فِي السَّمَاءِ وَهُوَ السَّمِيعُ العَلِيم""",
            telugu = """8 బిస్మిల్లాహిల్లజి లా యజుర్రు మఅస్మిహీ షైఉన్ ఫిల్ అర్జి వలా ఫిస్సమాఇ వహువస్సమీఉల్ అలీం. {3 సారి పఠించండి}""",
            meaning = """భావం : అల్లాహ్ పేరుతో, ఆయన పేరుతో ఏ వస్తువు నష్టపరచదు, ఆకాశంలోగాని, భూమిలోగాని, ఆయన వినువాడు, సర్వజ్ఞాని""",
            benefit = """ప్రయోజనం : పై దుఆ ఉదయం 3 సార్లు, సాయంకాలం 3 సార్లు చదివినవారికి ఏదీ నష్టపరచదు. (అబూదావూద్ 5088)."""
        ),
        ZikrItem(
            arabic = """يَا حَيُّ يَا قَيُّومُ بِكَ اَسْتَغِيثُ فَأَصْلِحْ لِيْ شَأْنِي وَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْن""",
            telugu = """9 యా హయ్యు యా ఖయ్యూమ్ బిక అస్తగీస్, ఫఅస్లిహ్ లీ షఅనీ వలా తкиల్నీ ఇలా నఫ్సీ తర్ఫత ఐన్. {1 సారి పఠించండి} (అబూ దావూద్ 5090).""",
            meaning = """భావం : ఓ సజీవుడా, విశ్వవ్యవస్థకు ఆధారభూతుడా! నీతోనే నేను మొరపెట్టుకుంటున్నాను. అందుకని నా ప్రతి కార్యాన్ని సజావుగా చేయు, కనురెప్పపాటు కూడా నన్ను నాకై అప్పగించకు .""",
            benefit = ""
        ),
        ZikrItem(
            arabic = """رَضِيتُ بِاللهِ رَبًّا وَ بِالإِسْلامِ دِ ينًا وَبِمُحَمَّدٍ ﷺ نَبِيًّا""",
            telugu = """10 రజీతు బిల్లాహి రబ్బౌఁ వబిల్ ఇస్లామి దీనౌఁ వ బిముహమ్మదిన్ సల్లల్లాహు అలైహి వసల్లమ నబియ్య. {3 సారి పఠించండి}""",
            meaning = """భావం : అల్లాహ్ ను ప్రభువుగా, ఇస్లాంను ధర్మంగా, ముహమ్మద్ సల్లల్లాహు అలైహి వసల్లంను ప్రవక్తగా నమ్మి సంతోషపడ్డాను .""",
            benefit = """ప్రయోజనం : ఈ దుఆ ఉదయం 3 సార్లు, సాయంకాలం 3 సార్లు చదివినవారితో అల్లాహ్ ప్రళయదినాన తప్పక సంతో- షంగా ఉంటాడు. (తిర్మిజి 3870). ◆ఈ దుఆ ఉదయం చదివినవారి చేయి పట్టుకొని స్వర్గంలో తీసుకెళ్తాను అని ప్రవక్త సల్లల్లాహు అలైహి వస్లలం చెప్పారు. (సహీహుత్ తర్గీబ్ 657)."""
        ),
        ZikrItem(
            arabic = """حَسْبِيَ الله لاَ إِلهَ إلاَّ هُوَ عَلَيهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيم""",
            telugu = """11 హస్బియల్లాహు లాఇలాహ ఇల్లాహువ అలైహి తవక్కల్తు వహువ రబ్బుల్ అర్షిల్ అజీం. {7 సారి పఠించండి} (అబూదావూద్ 5081).""",
            meaning = """భావం : నాకు అల్లాహ్ యే చాలు, ఆయన తప్ప నిజఆరాధ్యుడు ఎవ్వడూ లేడు, ఆయనపైనే నేను నమ్మకం ఉంచాను, ఆయన గొప్ప సింహాసనం యొక్క ప్రభువు""",
            benefit = ""
        ),
        ZikrItem(
            arabic = """اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلهَ إلاَّ أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَااسْتَطَعْتُ أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِيْ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ""",
            telugu = """12 అల్లాహుమ్మ అంత రబ్బి లా ఇలాహ ఇల్లా అంత ఖలక్ తనీ వ అనా అబ్దుక వఅన అలా అహ్దిక వ వఅదిక మస్తతఅతు అఊజు బిక మిన్ షర్రి మా సనఅతు అబూఉ లక బినిఅమతిక అలయ్య వఅబూఉ లక బిజంబీ ఫగ్ఫిర్లీ ఫఇన్నహూ లా యగ్ఫిరుజ్జునూబ ఇల్లా అంత. {1 సారి పఠించండి}""",
            meaning = """భావం : ఓ అల్లాహ్! నీవే నా ప్రభువు, నీవు తప్ప నిజఆరాధ్యుడు ఎవ్వడూ లేడు, నీవే నన్ను సృష్టించావు, నేను నీ దాసుడ్ని, నేను నీతో చేసిన ఒడంబడిక, వాగ్దానంపై స్థిరంగా ఉన్నాను, నేను పాల్పడిన పాపాల కీడు నుండి నీ శరణులోకి వచ్చుచున్నాను, నాపై ఉన్న నీ అనుగ్రహాలను నేను అంగీకరిస్తున్నాను, నా పాపాలను కూడా ఒప్పుకుంటున్నాను, నీవు నన్ను క్షమించు, పాపాలను క్షమించేవాడు నీ తప్ప ఎవడూ లేడు.""",
            benefit = """ప్రయోజనం : పై దుఆ పూర్తి విశ్వాసంతో ఉదయం చదివిన వ్యక్తి సాయంకాలముకు ముందే అతను మరణిస్తే స్వర్గంలో చేరుతాడు, ఒకవేళ సాయంకాలం పూర్తి నమ్మకంతో చదవి ఉదయించక ముందే మరణిస్తే స్వర్గంలో చేరుతాడు. (బుఖారి 6306)."""
        ),
        ZikrItem(
            arabic = """اللَّهُمَّ عَافِنِي فِي بَدَنِي اللَّهُمَّ عَافِنِي فِي سَمْعِي اللَّهُمَّ عَافِنِي فِي بَصَرِي لَا إِلَهَ إِلَّا أَنْتَ ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْكُفْرِ وَالْفَقْرِ وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ لَا إِلَهَ إِلَّا أَنْتَ""",
            telugu = """13 అల్లాహుమ్మ ఆఫినీ ఫీ బదనీ అల్లాహుమ్మ ఆఫినీ ఫీ సమ్ఈ అల్లాహుమ్మ ఆఫినీ ఫీ బసరీ లాఇలాహ ఇల్లా అంత, అల్లాహుమ్మ ఇన్నీ అఊజుబిక మినల్ కుఫ్రి వల్ ఫక్రి వ అఊజు బిక మిన్ అజాబిల్ కబ్రి లాఇలాహ ఇల్లా అంత. {1 సారి పఠించండి} (అబూ దావూద్ 5090).""",
            meaning = """భావం : ఓ అల్లాహ్! నా శరీరంలో స్వస్థత ప్రసాదించు, ఓ అల్లాహ్! నా చెవిలో స్వస్థత ప్రసాదించు, ఓ అల్లాహ్! నా దృష్టిలో స్వస్థత ప్రసాదించు, నీవు తప్ప నిజఆరాధ్యుడు ఎవ్వడూ లేడు. ఓ అల్లాహ్! సత్యతిరస్కారం మరియు బీదరికం నుండి నీ శరణు వేడుకుంటున్నాను , ఓ అల్లాహ్! సమాధి శిక్ష నుండి నీ శరణు వేడుకుంటున్నాను. నీవు తప్ప నిజఆరాధ్యుడు ఎవ్వడూ లేడు.""",
            benefit = ""
        ),
        ZikrItem(
            arabic = """اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ اَللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِيْنِي وَ دُنْيَايَ وَأَهْلِيْ وَمَالِيْ اللَّهُمَّ اسْتُرْ عَوْرَاتِيْ وَآمِنْ رَوْعَاتِي اللَّهُمَّ احْفَظْنِيْ مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِيْ وَعَنْ يَمِيْنِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي وَأَعُوذُ بِعَظْمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي""",
            telugu = """14 అల్లాహుమ్మ ఇన్నీ అస్అలుకల్ ఆఫియత ఫిద్దున్యా వల్ ఆఖిర, అల్లాహుమ్మ ఇన్నీ అస్అలుకల్ అఫ్వ వల్ ఆఫియత ఫీ దీనీ వ దున్యాయ వ అహ్లీ వ మాలీ, అల్లాహుమ్మస్ తుర్ ఔరాతీ వ ఆమిన్ రౌఆతీ అల్లాహుమ్మహ్ ఫజ్నీ మిన్ బైని యదయ్య వ మిన్ ఖల్ఫీ వ అన్ యమీనీ వ అన్ షిమాలీ వ మిన్ ఫౌకీ వ అఊజు బిఅజ్మతిక అన్ ఉగ్ తాల మిన్ తహ్ తీ. {1 సారి పఠించండి}""",
            meaning = """భావం : ఓ అల్లాహ్! నేను నీతో ఇహపరాల క్షేమాన్ని కోరుతున్నాను, ఓ అల్లాహ్! నేను నీతో నా ధార్మిక, ప్రాపంచిక ,ఇంటివారి, ఆస్తుల్లో మన్నింపు మరియు క్షేమాన్ని కోరుతున్నాను. ఓ అల్లాహ్! నా లోటుపోట్లను కప్పిఉంచు, నా భయాన్ని దూరం చేయి, ఓ అల్లాహ్! నన్ను నా ముందు నుండి, నా వెనక నుండి, నా కుడి, ఎడమ నుండి మరియు పై నుండి కాపాడు. నేను క్రింది నుండి కూడా ఏ కీడుకు గురి కాకుండా నీ ఔన్నత్యంతో నీ శరణులో వచ్చాను.""",
            benefit = ""
        ),
        ZikrItem(
            arabic = """اللَّهُمَّ فَاطِرَ السَّمَاوَاتِ وَالأرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ رَبَّ كُلِّ شَيْءٍ وَ مَلِيْكَهُ أَشْهَدُ أَن لاَّ إِلَهَ إِلاَّ أَنْتَ أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوْءً أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ""",
            telugu = """15 అల్లాహుమ్మ ఫాతిరస్సమావాతి వల్ అర్జి ఆలిమల్ గైబి వష్షహాదతి రబ్బ కుల్లి షైఇన్ వ మలీకహు అష్'హదు అల్లా ఇలాహ ఇల్లా అంత అఊజు బిక మిన్ షర్రి నఫ్సీ వ షర్రిష్ షైతాని వ షిర్కిహీ, వఅన్ అక్తరిఫ అలా నఫ్సీ సూఅన్ ఔ అజుర్రహూ ఇలా ముస్లిమ్. {1 సారి పఠించండి}""",
            meaning = """భావం : ఓ అల్లాహ్! భూమ్యాకాశాల సృష్టికర్తా! గోచర అగోచరాల జ్ఞానీ! ప్రతీ వస్తువు ప్రభువా! మరియు యజమానీ! నీ తప్ప నిజఆరాధ్యుడు ఎవడూ లేడని నేను సాక్ష్యమిస్తున్నాను, నేను నీ శరణులో వచ్చాను; నా ఆత్మ కీడు నుండి, షైతాన్ కీడు నుండి, అతని షిర్క్, ప్రేరేపణల నుండి, అలాగే నేను నా పట్ల- గాని లేదా ఎవరైనా ముస్లింను చెడుకు గురి చేయుట నుండి.""",
            benefit = ""
        ),
        ZikrItem(
            arabic = """يَا حَيُّ يَا قَيُّومُ بِكَ اَسْتَغِيثُ فَأَصْلِحْ لِيْ شَأْنِي وَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْن""",
            telugu = """16 యా హయ్యు యా ఖయ్యూమ్ బిక అస్తగీస్, ఫఅస్లిహ్ లీ షఅనీ వలా తకిల్నీ ఇలా నఫ్సీ తర్ఫత ఐన్. {1 సారి పఠించండి} (అబూ దావూద్ 5090).""",
            meaning = """భావం : ఓ సజీవుడా, విశ్వవ్యవస్థకు ఆధారభూతుడా! నీతోనే నేను మొరపెట్టుకుంటున్నాను. అందుకని నా ప్రతి కార్యాన్ని సజావుగా చేయు, కనురెప్పపాటు కూడా నన్ను నాకై అప్పగించకు .""",
            benefit = ""
        ),
        ZikrItem(
            arabic = """سُبْحَانَ الله وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ""",
            telugu = """17 సుబ్'హానల్లాహి వ బిహందిహీ అదద ఖల్కిహీ వ రిజా నఫ్సిహీ వ జినత అర్షిహీ వ మిదాద కలిమాతిహ్. {3సార్లు పఠించండి}""",
            meaning = """భావం : అల్లాహ్ స్తోత్రముతో పాటు ఆయన పవిత్రతను కొనియాడుతున్నాను, ఆయన సమస్తసృష్టి రాసుల పరిమాణంలో, ఆయన ఇష్టపడేటంతటి, మరియు ఆయన సింహాసన బరువుకు సమానంగా మరియు ఆయన స్తోత్రం తో కూడిన పవిత్ర వచనాలు వ్రాయబడే సిరా అంత పరిమాణంలో ఆయనను ప్రశంసిస్తున్నాను . ◆(ఈ ఆఖరి మాటలో ఉన్న సిరా పరిమాణం గూర్చి గ్రహించేందుకు గాను ఖుర్ఆన్ 31 : 27 _ 18 : 109 దర్శించండి )""",
            benefit = """ప్రయోజనం : ఈదుఆ ఫజ్ర్ తర్వాత 3 సార్లు చదివితే, ఫజ్ర్ నుండి చాష్త్ సమయం వరకు చేసే జిక్ర్ కు సమానమైన పుణ్యం లభిస్తుంది. (ముస్లిం 2726)."""
        ),
        ZikrItem(
            arabic = """سُبْحَانَ اللهِ وَ بِحَمْدِهِ (100 مرة)""",
            telugu = """18 సుబ్'హానల్లాహి వబిహందిహీ. (100 సార్లు )""",
            meaning = """భావం : అల్లాహ్ ప్రశంసతో పాటు ఆయన పవిత్రతను నేను కొనియాడు చున్నాను.""",
            benefit = """ప్రయోజనం : ఈ జిక్ర్ ఉదయం 100 సార్లు, సాయంకాలం 100 సార్లు చదివినవారికంటే ఉత్తములు ప్రళయదినాన మరెవరూ ఉండరు, కేవలం అతని పరిమాణంలో, లేదా అతని కంటే ఎక్కువ చదివిన వ్యక్తి తప్ప. (ముస్లిం 2692). మరియు ఈ జిక్ర్ ఉదయం, సాయంకాలం , వంద సార్లు చదివిన వారి పాపాలు సముద్రపు నురుగుకు సమానమైనప్పటికీ క్షమించబడతాయి. (సహీహుత్ తర్గీబ్ 653)."""
        ),
        ZikrItem(
            arabic = """أَعُوذُ بِكَلِمَاتِ الله التَّامَّاتِ مِن شَرِّ مَا خَلَق""",
            telugu = """19 أఊజు బికలిమాతిల్లాహిత్తామ్మాతి మిన్ షర్రి మా ఖలఖ్. {3 సార్లు పఠించండి}""",
            meaning = """భావం : అల్లాహ్ సంపూర్ణ వచనాలతో నేను శరణు కోరుతున్నాను, ఆయన సృష్టిలో ఉన్న సర్వ కీడుల నుండి. {3 సారి పఠించండి}""",
            benefit = """ప్రయోజనం : ఈ దుఆ సాయంకాలం 3 సార్లు చదివినవారికి ఆ రాత్రి ఏ విషపురుగు హాని కలిగించదు. (ముస్లిం 2709)."""
        ),
        ZikrItem(
            arabic = """أَسْتَغْفِرُ اللهَ وَأَتُوبُ إِلَيْهِ""",
            telugu = """20 అస్తగ్ ఫిరుల్లాహ వ అతూబు ఇలైహ్. { 100 సార్లు పఠించండి}""",
            meaning = """భావం : నేను అల్లాహ్ యొక్క మన్నింపు వేడుకుంటున్నాను, ఆయన సమక్షంలో తౌబా (प्रत्यతాపము) చేస్తున్నాను .""",
            benefit = """ప్రయోజనం : ◆ఈ జిక్ర్ ప్రవక్త సల్లల్లాహు అలైహివ వసల్లం ప్రతి రోజు వందసార్లు చదివేవారు. (ముస్లిం 2702)."""
        ),
        ZikrItem(
            arabic = """اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ عَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ . اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَ عَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ""",
            telugu = """21 దరూద్ ◆ అల్లాహుమ్మ సల్లి అలా ముహమ్మదివ్ వ అలా ఆలి ముహమ్మద్ కమా సల్లయిత అలా ఇబ్రహీమ వ అలా ఆలి ఇబ్రహీమ ఇన్నక హమీదుంమ్మజీద్ . అల్లాహుమ్మ బారిక్ అలా ముహమ్మదివ్ వ అలా ఆలి ముహమ్మద్ కమా బారక్ త అలా ఇబ్రహీమ వ అలా ఆలి ఇబ్రహీమ ఇన్నక హమీదుంమ్మజీద్ .""",
            meaning = """భావం : ఓ.! అల్లాహ్ ముహమ్మద్(సల్లల్లాహు అలైహి వ సల్లం) వారినీ మరియు ఆయన కుటుంబం వారినీ కరుణించు .ఏ విధంగానైతే ఇబ్రహీం(అలైహిసలాం) వారినీ మరియు ఆయన కుటుంబాన్ని నీవు కరుణించావో..నీవే స్తోత్రానికి అర్హుడవు, ఘనత గలవాడవు. ఓ ! అల్లాహ్ ముహమ్మద్ (సల్లల్లాహు అలైహి వ సల్లం ) వారిపై ఆయన కుటుంబం వారిపై శుభాలు కురిపించు , ఏ విధంగానైతే ఇబ్రహీం (అలైహిసలాం) వారిపై మరియు ఆయన కుటుంబం వారిపై నీవు శుభాలు కురిపించావో నిస్సందేహంగా నీవే స్తుతింపదగినవాడవు , ఘనత గల వాడవు .""",
            benefit = """ప్రయోజనం : అల్లాహుమ్మ సల్లి వసల్లిమ్ వబారిక్ అలా నబియ్యినా ముహమ్మద్. భావం: ఓ అల్లాహ్ ప్రవక్త ముహమ్మద్ పై కరుణ, శాంతులు, శుభాలు కురిపించు. ప్రయోజనం: ఉదయం 10 సార్లు, సాయంకాలం 10 సార్లు దరూద్ చదివినవారి పట్ల ప్రవక్త సల్లల్లాహు అలైహి వసల్లం ప్రళయం నాడు సిఫారసు చేస్తారు. (సహీహుల్ జామి 6357)."""
        ),
        ZikrItem(
            arabic = """سُبْحَانَ اللهِ، والْحَمْدُ للهِ، وَلا إلَهَ إلاَّ اللهُ، وَاللهُ أكْبَرُ""",
            telugu = """22 సుబ్'హానల్లాహ్, అల్ హందులిల్లాహ్, లాఇలాహ ఇల్లల్లాహ్, అల్లాహు అక్బర్.""",
            meaning = "",
            benefit = """ప్రయోజనం: సూర్యోదయానికి ముందు, సూర్యాస్తమయానికి ముందు 100 సార్లు ‘సుబ్ హానల్లాహ్’ పలుకుట అల్లాహ్ మార్గంలో వదిలిన 100 ఒంటెల కంటే ఉత్తమం, 100 సార్లు ‘అల్ హందులిల్లాహ్’ పలుకుట అల్లాహ్ మార్గంలో వదిలిన 100 గుర్రాల కంటే ఉత్తమం. 100 సార్లు ‘అల్లాహు అక్బర్’ పలుకుట 100 బానిసలను విముక్తి కలిగించుట కంటే ఉత్తమం, 100 సార్లు ‘లాఇలాహ ఇల్లల్లాహు వహ్ దహూ లా షరీక లహూ లహుల్ ముల్కు లహుల్ హందు వహువ అలా కుల్లి షైఇన్ ఖదీర్’ పలికే వ్యక్తి కంటే ఉత్తమ ఆచరణ ప్రళయదినాన మరెవరిదీ ఉండదు, కేవలం అదే సంఖ్యలో లేదా అంతకంటే ఎక్కువ సంఖ్యలో పలికిన వ్యక్తి ఆచరణ తప్ప . (సహీ తర్గీబ్ 658)."""
        ),
        ZikrItem(
            arabic = """اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَ عَمَلاً مُتَقَبَّلاً""",
            telugu = """23 అల్లాహుమ్మ ఇన్నీ అస్అలుక ఇల్మన్ నాఫిఆ, వ రిజ్ఖన్ తయ్యిబా, వ అమలమ్ ముతకబ్బలా. ◆(కేవలం ఫజ్ర్ నమాజు తర్వాత 1 సاري పఠించండి ). [ఇబ్ను మాజ 925]""",
            meaning = """భావం: ఓ అల్లాహ్! ప్రయోజనకరమైన విద్య, పవిత్రమైన ఆహారం మరియు అంగీకారయోగ్యం పొందే ఆచరణ భాగ్యం ప్రసాదించమని నిన్నే వేడుకుంటును.""",
            benefit = ""
        )
    )

    val appChapters = listOf(
        ChapterModel(
            id = "1",
            titleTelugu = "ఉదయం జిక్ర్ (Morning)",
            titleArabic = "أذكار الصباح",
            icon = Icons.Rounded.WbSunny,
            color = Color(0xFFF59E0B),
            azkarList = morningAzkar
        ),
        ChapterModel(
            id = "2",
            titleTelugu = "సాయంత్రం జిక్ర్ (Evening)",
            titleArabic = "أذكار المساء",
            icon = Icons.Rounded.NightlightRound,
            color = Color(0xFF3B82F6),
            azkarList = eveningAzkar
        ),
        ChapterModel(
            id = "3",
            titleTelugu = "ఖుర్ఆన్ దుఆలు",
            titleArabic = "أدعية قرآنية",
            icon = Icons.Rounded.MenuBook,
            color = Color(0xFF10B981),
            azkarList = emptyList()
        ),
        ChapterModel(
            id = "4",
            titleTelugu = "నమాజ్ తర్వాత జిక్ర్",
            titleArabic = "أذكار بعد الصلاة",
            icon = Icons.Rounded.Mosque,
            color = Color(0xFF8B5CF6),
            azkarList = emptyList()
        )
    )
}
